---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalImage
source: html/f0c40869-a74c-d9e5-064e-2ab6db533b27.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DecalImage Property

An external resource type representing decal images.

## Syntax (C#)
```csharp
public static ExternalResourceType DecalImage { get; }
```